In [2]:
import pandas as pd
salario=pd.read_csv('C:/Users/JackelinNuñezAguirre/Documents/project/project1/linkedin-jobs-usa.csv')
salario

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...
...,...,...,...,...,...,...,...,...,...
2840,Junior Data Analyst,Iris Software Inc.,"Iris's client, one of the world's largest fina...",hybrid,NaN,"Texas, United States","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-21,https://www.linkedin.com/jobs/view/junior-data...
2841,Data Analyst (SQL),Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,"$75,000.00\r\n -\r\n $95...",New York City Metropolitan Area,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...
2842,Data Analyst,SmartSense by Digi,"Join a high-performing, tight-knit team at a f...",hybrid,NaN,"Mishawaka, IN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,"$85,000.00\r\n -\r\n $95...",Nashville Metropolitan Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,"$130,000.00\r\n -\r\n $1...","Burbank, CA","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...

In [4]:
salario.shape

(2845, 9)

In [5]:
salario.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2845 entries, 0 to 2844
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   title          2845 non-null   object
 1   company        2845 non-null   object
 2   description    2845 non-null   object
 3   onsite_remote  2845 non-null   object
 4   salary         929 non-null    object
 5   location       2845 non-null   object
 6   criteria       2845 non-null   object
 7   posted_date    2845 non-null   object
 8   link           2845 non-null   object
dtypes: object(9)
memory usage: 200.2+ KB

In [12]:
salario.dtypes

title            object
company          object
description      object
onsite_remote    object
salary           object
location         object
criteria         object
posted_date      object
link             object
dtype: object

In [10]:
salario.drop_duplicates()
salario.shape

(2845, 9)

In [12]:
#tratamiento de datos nulos 
df_sinnulos=salario.dropna()
df_sinulos_columnas=salario.dropna(axis=1)
df_sinnulos

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
8,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
24,Data Analyst,"Eva Garland Consulting, LLC","Reporting to the Director of Operations, the D...",onsite,"$50,000.00\r\n -\r\n $55...","Raleigh, NC","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
35,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
61,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
88,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
...,...,...,...,...,...,...,...,...,...
2834,Junior Data Analyst,Insight Global,"This is a One Year Contract to Hire, 40 hours ...",hybrid,$30.00\r\n -\r\n $33.00,Denver Metropolitan Area,"[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-16,https://www.linkedin.com/jobs/view/junior-data...
2836,Data Analyst,Gridiron IT,Gridiron IT is seeking a Data Analyst local to...,hybrid,"$120,000.00\r\n -\r\n $1...","District of Columbia, United States","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-04,https://www.linkedin.com/jobs/view/data-analys...
2841,Data Analyst (SQL),Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,"$75,000.00\r\n -\r\n $95...",New York City Metropolitan Area,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,"$85,000.00\r\n -\r\n $95...",Nashville Metropolitan Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,"$130,000.00\r\n -\r\n $1...","Burbank, CA","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...

In [17]:
df_sinnulos['salary']

8       $100,000.00\r\n            -\r\n            $1...
24      $50,000.00\r\n            -\r\n            $55...
35      $100,000.00\r\n            -\r\n            $1...
61      $100,000.00\r\n            -\r\n            $1...
88      $100,000.00\r\n            -\r\n            $1...
                              ...
2834        $30.00\r\n            -\r\n            $33.00
2836    $120,000.00\r\n            -\r\n            $1...
2841    $75,000.00\r\n            -\r\n            $95...
2843    $85,000.00\r\n            -\r\n            $95...
2844    $130,000.00\r\n            -\r\n            $1...
Name: salary, Length: 929, dtype: object

In [13]:
## Este código toma una columna `'salary'` que contiene valores de salario en formato de cadena, 
## elimina cualquier caracter no numérico, extrae los dígitos y convierte la columna resultante en valores numéricos de tipo float. 
## El resultado se almacena en una nueva columna llamada `'salary_numeric'`. 
## Esto es útil cuando la columna `'salary'` inicial contiene caracteres no numéricos y se desea trabajar con los salarios como valores numéricos
df_sinnulos['salary_numeric']  = df_sinnulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

#que tipo de funciones aplicar para parsear la columna

<>:5: SyntaxWarning: invalid escape sequence '\d'
<>:5: SyntaxWarning: invalid escape sequence '\d'
<>:5: SyntaxWarning: invalid escape sequence '\d'
<>:5: SyntaxWarning: invalid escape sequence '\d'
C:\Users\JackelinNuñezAguirre\AppData\Local\Temp\ipykernel_13888\3288987281.py:5: SyntaxWarning: invalid escape sequence '\d'
  df_sinnulos['salary_numeric']  = df_sinnulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)
C:\Users\JackelinNuñezAguirre\AppData\Local\Temp\ipykernel_13888\3288987281.py:5: SyntaxWarning: invalid escape sequence '\d'
  df_sinnulos['salary_numeric']  = df_sinnulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)
C:\Users\JackelinNuñezAguirre\AppData\Local\Temp\ipykernel_13888\3288987281.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sinnulos['salary_numeric']  = df_sinnulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

In [8]:
df_sinnulos['salary_numeric'].describe

<bound method NDFrame.describe of 8       100000.0
24       50000.0
35      100000.0
61      100000.0
88      100000.0
          ...
2834        30.0
2836    120000.0
2841     75000.0
2843     85000.0
2844    130000.0
Name: salary_numeric, Length: 929, dtype: float64>

In [22]:
df_sinnulos.drop('salary',axis=1,inplace=True)

C:\Users\JackelinNuñezAguirre\AppData\Local\Temp\ipykernel_13368\1492441918.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sinnulos.drop('salary',axis=1,inplace=True)

In [23]:
df_sinnulos

,title,company,description,onsite_remote,location,criteria,posted_date,link,salary_numeric
8,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000.0
24,Data Analyst,"Eva Garland Consulting, LLC","Reporting to the Director of Operations, the D...",onsite,"Raleigh, NC","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...,50000.0
35,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000.0
61,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000.0
88,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000.0
...,...,...,...,...,...,...,...,...,...
2834,Junior Data Analyst,Insight Global,"This is a One Year Contract to Hire, 40 hours ...",hybrid,Denver Metropolitan Area,"[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-16,https://www.linkedin.com/jobs/view/junior-data...,30.0
2836,Data Analyst,Gridiron IT,Gridiron IT is seeking a Data Analyst local to...,hybrid,"District of Columbia, United States","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-04,https://www.linkedin.com/jobs/view/data-analys...,120000.0
2841,Data Analyst (SQL),Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,New York City Metropolitan Area,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...,75000.0
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,Nashville Metropolitan Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...,85000.0
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,"Burbank, CA","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...,130000.0

In [30]:
df_sinnulos['salary_numeric']=df_sinnulos['salary_numeric'].round(0).astype(int)

C:\Users\JackelinNuñezAguirre\AppData\Local\Temp\ipykernel_13368\1800348692.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sinnulos['salary_numeric']=df_sinnulos['salary_numeric'].round(0).astype(int)

In [31]:
df_sinnulos.head()

,title,company,description,onsite_remote,location,criteria,posted_date,link,salary_numeric
8,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000
24,Data Analyst,"Eva Garland Consulting, LLC","Reporting to the Director of Operations, the D...",onsite,"Raleigh, NC","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...,50000
35,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000
61,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000
88,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000